# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'nicoverbruggen/cask'
tap 'romkatv/powerlevel10k'
tap 'axllent/apps'
tap 'nicoverbruggen/homebrew-cask'
tap 'humansignal/tap'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts
brew '1password-cli'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Utils
brew 's3cmd'
brew 'rclone'
brew 'zsh-autosuggestions'
brew 'romkatv/powerlevel10k/powerlevel10k'

# PHP Development
brew 'pnpm'
brew 'mailpit', restart_service: true
brew 'meilisearch', restart_service: true
# brew 'typesense/tap/typesense-server', restart_service: true
brew 'rsync'
brew 'ngrok/ngrok/ngrok'

# iOs and Adroid Devlopment
brew 'scrcpy'
brew 'android-platform-tools'
brew 'kdoctor'

# Install pyython development
brew 'paython3'
brew 'humansignal/tap/label-studio'

# Apps
cask 'herd'
cask '1password'
cask 'cyberduck'
cask 'dbngin'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'github'
cask 'google-chrome'
cask 'herd'
cask 'imageoptim'
cask 'postman'
cask 'raycast'
cask 'screenflow'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'warp'
cask 'webtorrent'
cask 'whatsapp'
cask 'jetbrains-toolbox'

# Fonts
cask 'font-inter'
cask 'font-jetbrains-mono'