# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'minio/stable'
tap 'nicoverbruggen/cask'
tap 'romkatv/powerlevel10k'
tap 'axllent/apps'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Utils
brew 's3cmd'
brew 'rclone'
brew 'zsh-autosuggestions'
brew 'romkatv/powerlevel10k/powerlevel10k'

# PHP Development
brew 'php'
brew 'postgresql@15'
brew 'mysql'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'nginx', restart_service: true
brew 'node'
brew 'redis', restart_service: true
brew 'yarn'
brew 'mailpit', restart_service: true
brew 'railway'
brew 'railwayapp/tap/nixpacks'
brew 'watchman'

# Flutter Devlopment
brew 'flutter'
brew 'cocoapods'
brew 'scrcpy'
brew 'android-platform-tools'

# Apps
cask 'raycast'
cask 'cyberduck'
cask 'visual-studio-code'
cask '1password'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'imageoptim'
cask 'insomnia'
cask 'screenflow'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'transmit'
cask 'whatsapp'
cask 'zoom'
cask 'phpmon'

# Fonts
cask 'font-inter'
cask 'font-jetbrains-mono'

# Mac App Store
mas 'Speedtest', id: 1153157709