# Taps
tap 'romkatv/powerlevel10k'
tap 'shivammathur/extensions

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts
brew 'gnupg'

# Utils
brew 'zsh-autosuggestions'
brew 'powerlevel10k'
brew 'wget'
brew 'tree'

# iOS and Android Development
brew 'scrcpy'
brew 'kdoctor'

# PHP Development
brew 'php'
brew 'composer'
brew 'shivammathur/extensions/pcov@8.5'

# IoT
brew 'mosquitto'

# Node
brew 'node@24'

# Python
brew 'python@3.14'

# AI 
brew 'opencode'

# Other Tools
brew 'certbot'
brew 'ruby'
brew 'ansible'
brew 'mole'

# Casks (GUI Applications)
cask 'yaak'
cask 'vlc'
cask '1password'
cask '1password-cli'
cask 'android-platform-tools'
cask 'imageoptim'
cask 'tableplus'
cask 'brave-browser'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'whatsapp'
cask 'figma'
cask 'orbstack'
cask 'r-app'
cask 'visual-studio-code'
cask 'google-chrome'
cask 'warp'
cask 'jordanbaird-ice'
cask 'onedrive'
cask 'bing-wallpaper'
cask 'raycast'
cask 'jetbrains-toolbox'
cask 'webtorrent'
cask 'image2icon'
cask 'chatgpt'
cask 'protonvpn'


# Fonts
cask 'font-jetbrains-mono'